Config/InformationRegisters/PersonalDataSources.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>PersonalDataSources</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Clients</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/PersonalDataSources/Ext/ManagerModule.bsl
#Region Public

// --------------------------------------------------------------------------------
Procedure ExchangePlansRecordChanges(pData, pReceiverNode = Undefined) Export
	vObject = pData.Filter.Object.Value;
	If ValueIsFilled(vObject) Then
		// ExchangePlansProcessing.ExchangePlansRecordChanges(pData, vObject.Hotel, pReceiverNode);
	EndIf;		
EndProcedure // ExchangePlansRecordChanges

// --------------------------------------------------------------------------------
//  Write user event log
//
// Parameters:
//  pClient	 - CatalogRef.Clients	 - Ref
//  pSource	 - String				 - Source information
//  pHotel	 - CatalogRef.Hotels	 - Ref
//  pUser	 - CatalogRef.Employees	 - Ref user
//  pDate	 - Date					 - Date changes
//
Procedure AddRecord(pClient, pSource, pHotel = Undefined, pUser = Undefined, pDate = Undefined) Export
    vUser = SessionParameters.CurrentUser;
	If Not pUser = Undefined Then
		vUser = pUser;
	EndIf;
	vDate = CurrentSessionDate();
	If Not pDate = Undefined Then
		vDate = pDate;
	EndIf; 
	vHotel = SessionParameters.CurrentHotel;
	If ValueIsFilled(pHotel) Then
		vHotel = pHotel;
	EndIf;	
	vRec = InformationRegisters.PersonalDataSources.CreateRecordManager();
	vRec.Period = vDate;  
	vRec.Hotel = vHotel;
	vRec.User = vUser;
	vRec.Client = pClient;
	vRec.Source = pSource;
				
	// Write record
	vRec.Write(True);
EndProcedure

#EndRegion
